dart 공식 홈페이지 : https://dart.dev/

Dart SDK 2.16 : 2021.02.04에 업데이트 됨. Flutter 2.10과 함께 업데이트 되었음.
주요 내용으로는 언어 기능 업데이트는 없음. 버그와 안전성을 개선하였고, pub.dev의 이용을 편하게 하였음. 그리고 dart 2.12에서 말했던 null safety에 참여한 패키지들의 진척도를 말하려고 함.
우선 pub.dev의 search UI를 개선했고, 레거시 툴들을 새 다트 개발툴에 합치는 중임. Dart 2.17에 꽤 다수의 레거시 툴들을 완전히 합쳐낼 것임.
또한 다트는 이식성과 다수의 플랫폼에서의 호환성을 목표로 개발되었지만 유저들의 이용 과정에서 어쩔 수 없이 플랫폼 종속성이 생길수가 있음. 그것을 위해 pub.dev에서 쉽게 검색할 수 있도록 declaring에서 새 태그를 추가하였음.
널 세이프티에 대해서 말하자면 Dart 2.12에서 처음 언급된 널 세이프티에 대해 유저들이 적극 참여하여 탑 250개 패키지가 100%, 탑 1000개 패키지가 96% 널 세이프티를 지원하게 됐음!
앱의 상태 또한 좋은데, 플러터 툴에서는 71%의 세션이 널 세이프티를 지원중이라는 통계가 잡혔음. 아무튼 좋은 징조다!
다음 일정은 언어에 기능이 들어갈 것이며, 올해 늦은 날에 업데이트 될 것임!

요약 : 기능 업데이트 X. 안정성 및 버그 개선, pub.dev 이용성 개선, null safety 소식 전하려 옴. 대체로 안정성에 대해 이야기 하려 

출처 : https://medium.com/dartlang/dart-2-16-improved-tooling-and-platform-handling-dd87abd6bad1
